/*╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺
    ⭐ＰＲＯＪＥＣＴ ＮＡＭＥ:
    ＳＵＢＺＥＲＯ ＷＨＡＴＳＡＰＰ ＭＤ ＢＯＴ
    
    ⭐ＤＥＶＥＬＯＰＥＲ
     ＭＲ ＦＲＡＮＫ 
     
    ⭐ ＭＹ ＴＥＡＭ
     ＸＥＲＯ ＣＯＤＥＲＳ
     
    ⭐ ＯＵＲ ＷＥＢＳＩＴＥ
     https://github.com/ZwSyntax/SUBZERO-MD

© I smell A Noobie Copy Cat🤣⚠
*/

function hi() {
  console.log("Hello orld!");

hi();
function hi() {
  console.log("Hello World!");
}
hi();
const config = require("../config");
const {
  cmd,
  commands
} = require("../command");

const {
  runtime
} = require("../lib/functions");
cmd({
  'pattern': 'menu',
  'react': '✅',
  'alias': ["panel", 'subzeromenu'],
  'desc': "Get bot's command list.",
  'category': 'main',
  'use': ".menu",
  'filename': __filename
}, async (_0x2fc230, _0x2332c3, _0x36bc7b, {
  from: _0x1e7838,
  l: _0x55058a,
  quoted: _0x2a0c9e,
  body: _0x57a9b5,
  isCmd: _0x37623f,
  umarmd: _0x29fa63,
  args: _0x24a919,
  q: _0xf7b503,
  isGroup: _0x546fd3,
  sender: _0x11ab00,
  senderNumber: _0x3cb103,
  botNumber2: _0x4be52a,
  botNumber: _0x301c9a,
  pushname: _0x53202d,
  isMe: _0x421d43,
  isOwner: _0x39252f,
  groupMetadata: _0x37fdb0,
  groupName: _0x5ab450,
  participants: _0x253c3b,
  groupAdmins: _0x46bca8,
  isBotAdmins: _0x125ac0,
  isAdmins: _0x184909,
  reply: _0x23283b
}) => {
  try {
    let _0x239d66 = "\n\n╭╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺◈\n┊┌⟝⟢ " + config.BOT_NAME + " ⟣⟞\n┊│╭─────────────···◈\n┊┴│\n┊➮│▧ *ᴄʀᴇᴀᴛᴏʀ* : *ᴍʀ ғʀᴀɴᴋ (🇿🇼)*\n┊➮│▧ *ᴍᴏᴅᴇ* : *[" + config.MODE + "]*\n┊➮│▧ *ᴘʀᴇғɪx* : *[" + config.PREFIX + "]*\n┊➮│▧ *ʀᴀᴍ* : " + (process.memoryUsage().heapUsed / 0x400 / 0x400).toFixed(0x2) + "MB / " + Math.round(require('os').totalmem / 0x400 / 0x400) + "MB\n┊➮│▧ *ɴᴀᴍᴇ ʙᴏᴛ* : *sᴜʙᴢᴇʀᴏ ᴍᴅ*\n┊➮│▧ *ᴠᴇʀsɪᴏɴ* : *1.0.1*\n┊➮│▧ *ᴜᴘᴛɪᴍᴇ* : " + runtime(process.uptime()) + "\n┊➮│▸\n┬   │\n│   ╰────────────···◈\n└──────────────────···◈\n\n> ＳＵＢＺＥＲＯ - ＭＤ- ＢＯＴ\n\n\n*📥 `SUBZERO DOWNLOADER` 📥* \n\n╭─────────────···◈\n*┋* *ғʙ*\n*┋* *.ɪɴꜱᴛᴀ*\n*┋* *.ᴠɪᴅᴇᴏ*\n*┋* *.ɢᴅʀɪᴠᴇ*\n*┋* *.ᴛᴡɪᴛᴛᴇʀ*\n*┋* *.ᴛᴛ*\n*┋* *.ᴍᴇᴅɪᴀғɪʀᴇ*\n*┋* *.ꜱᴏɴɢ*\n*┋* *.ᴘʟᴀʏ*\n*┋* *.ᴠɪᴅᴇᴏ*\n*┋* *.ᴠɪᴅᴇᴏ2*\n*┋* *.ɪᴍɢ*\n*┋* *.ᴀᴘᴋ*\n*┋* *.ᴅᴀʀᴀᴍᴀ*\n*┋* *.ᴘʟᴀʏ2*\n*┋* *.ʙᴀɪsᴄᴏᴘᴇ*\n*┋* *.ɢɪɴɪsɪsɪʟᴀ*\n*╰─────────────╶╶···◈*\n\n*🔎 `SEARCH-CMD` 🔍* \n\n╭─────────────···◈\n*┋* *.ʏᴛꜱ*\n*┋* *.ʏᴛᴀ*\n*┋* *.ʟᴏʟɪ*\n*┋* *.ᴍᴏᴠɪᴇɪɴғᴏ*\n*┋* *.ᴍᴏᴠɪᴇ*\n*┋* *.ᴡᴇᴀᴛʜᴇʀ*\n*╰─────────────╶╶···◈*\n\n*🧠 `AI-CMD` 🧠* \n\n╭─────────────···◈\n*┋* *.ɢᴘᴛ*\n*┋* *.ᴀɪ*\n*┋* *.ʙᴏᴛ*\n*┋* *.sᴜʙᴢᴇʀᴏ*\n*╰─────────────╶╶···◈*\n\n*👨‍💻 `OWNER-CMD` 👨‍💻* \n\n╭─────────────···◈\n*┋* *.ᴜᴘᴅᴀᴛᴇᴄᴍᴅ*\n*┋* *.sᴇᴛᴛɪɴɢs*\n*┋* *.ᴏᴡɴᴇʀ*\n*┋* *.ʀᴇᴘᴏ*\n*┋* *.ꜱʏꜱᴛᴇᴍ*\n*┋* *.ꜱᴛᴀᴛᴜꜱ*\n*┋* *.ʙʟᴏᴄᴋ*\n*┋* *.ᴜɴʙʟᴏᴄᴋ*\n*┋* *.sʜᴜᴛᴅᴏᴡɴ*\n*┋* *.ᴄʟᴇᴀʀᴄʜᴀᴛs*\n*┋* *.sᴇᴛᴘᴘ*\n*┋* *.ʙʀᴏᴀᴅᴄᴀsᴛ*\n*┋* *.ᴊɪᴅ*\n*┋* *.ɢᴊɪᴅ*\n*┋* *.ʀᴇꜱᴛᴀʀᴛ*\n*╰─────────────╶╶···◈*\n\n*👥 `GROUP-CMD` 👥* \n\n╭─────────────···◈\n*┋* *.ʀᴇᴍᴏᴠᴇ*\n*┋* *.ᴅᴇʟᴇᴛᴇ*\n*┋* *.ᴀᴅᴅ*\n*┋* *.ᴋɪᴄᴋ*\n*┋* *.ᴋɪᴄᴋᴀʟʟ*\n*┋* *.sᴇᴛɢᴏᴏᴅʙʏᴇ*\n*┋* *.sᴇᴛᴡᴇʟᴄᴏᴍᴇ*\n*┋* *.ᴘʀᴏᴍᴏᴛᴇ*\n*┋* *.ᴅᴇᴍᴏᴛᴇ*\n*┋* *.ᴛᴀɢᴀʟʟ*\n*┋* *.ɢᴇᴛᴘɪᴄ*\n*┋* *.ɪɴᴠɪᴛᴇ*\n*┋* *.ʀᴇᴠᴏᴋᴇ*\n*┋* *.ᴊᴏɪɴʀᴇǫᴜᴇsᴛs*\n*┋* *.ᴀʟʟʀᴇǫ*\n*┋* *.ᴍᴜᴛᴇ*\n*┋* *.ᴜɴᴍᴜᴛᴇ*\n*┋* *.ʟᴏᴄᴋɢᴄ*\n*┋* *.ᴜɴʟᴏᴄᴋɢᴄ*\n*┋* *.ʟᴇᴀᴠᴇ*\n*┋* *.ᴜᴘᴅᴀᴛᴇɢɴᴀᴍᴇ*\n*┋* *.ᴜᴘᴅᴀᴛᴇɢᴅᴇsᴄ*\n*┋* *.ᴊᴏɪɴ*\n*┋* *.ʜɪᴅᴇᴛᴀɢ*\n*┋* *.ɢɪɴғᴏ*\n*┋* *.ᴅɪsᴀᴘᴘᴇᴀʀ ᴏɴ*\n*┋* *.ᴅɪsᴀᴘᴘᴇᴀʀ ᴏғғ*\n*┋* *.ᴅɪsᴀᴘᴘᴇᴀʀ 7ᴅ 24ʜ 90ᴅ*\n*┋* *.sᴇɴᴅᴅᴍ*\n*╰─────────────╶╶···◈*\n\n*📃 `INFO-CMD` 📃* \n\n╭─────────────···◈\n*┋* *.ᴍᴇɴᴜ*\n*┋* *.ᴍᴇɴᴜ2*\n*┋* *.ᴍᴇɴᴜ3*\n*┋* *.ᴀʙᴏᴜᴛ*\n*┋* *.sᴄʀɪᴘᴛ*\n*┋* *.ʀᴇᴘᴏ*\n*┋* *.ᴍʀғʀᴀɴᴋ*\n*┋* *.ᴀʟɪᴠᴇ*\n*┋* *.ʙᴏᴛɪɴꜰᴏ*\n*┋* *.ꜱᴛᴀᴛᴜꜱ*\n*┋* *.ꜱᴜᴘᴘᴏʀᴛ*\n*┋* *.ᴘɪɴɢ*\n*┋* *.ᴘɪɴɢ2*\n*┋* *.ꜱʏꜱᴛᴇᴍ*\n*╰─────────────╶╶···◈*\n\n*🎡 `CONVERTER-CMD` 🎡* \n\n╭─────────────···◈\n*┋* *.sᴛɪᴄᴋᴇʀ*\n*┋* *.ᴛʀᴛ*\n*┋* *.ᴛᴛs*\n*╰─────────────╶╶···◈*\n\n*⛱️ `RANDOM-CMD` ⛱️* \n\n╭─────────────···◈\n*┋* *.sᴜʙᴢᴇʀᴏ*\n*┋* *.ᴅᴏɢ*\n*┋* *.ᴀɴɪᴍᴇ*\n*┋* *.ᴀɴɪᴍᴇɢɪʀʟ*\n*┋* *.ᴀɴɪᴍᴇɢɪʀʟ1*\n*┋* *.ᴀɴɪᴍᴇɢɪʀʟ2*\n*┋* *.ᴀɴɪᴍᴇɢɪʀʟ3*\n*┋* *.ᴀɴɪᴍᴇɢɪʀʟ4*\n*┋* *.ᴀɴɪᴍᴇɢɪʀʟ5*\n*╰─────────────╶╶···◈*\n\n*🏜️ `WALLPAPERS-CMD` 🏜️* \n\n╭─────────────···◈\n*┋* *.ɪᴍɢ*\n*╰─────────────╶╶···◈*\n\n*🌐 `OTHER-CMD` 🌐* \n\n╭─────────────···◈\n*┋* *.ᴛʀᴛ*\n*┋* *.ᴊᴏᴋᴇ*\n*┋* *.ꜰᴀᴄᴛ*\n*┋* *.ɢɪᴛʜᴜʙ*\n*┋* *.ɢᴘᴀꜱꜱ*\n*┋* *.ʜᴀᴄᴋ*\n*┋* *.ǫᴜᴏᴛᴇ*\n*┋* *.ʀᴇᴘᴏ*\n*┋* *.ᴅᴇꜰɪɴᴇ*\n*╰─────────────╶╶···◈*\n\n\n━━━━━━━━━━━━━━━━━━━━*⁠⁠⁠⁠\n> ＭＡＤＥ ＢＹ ＭＲ ＦＲＡＮＫ\n━━━━━━━━━━━━━━━━━━━━━\n";
    await _0x2fc230.sendMessage(_0x1e7838, {
      'image': {
        'url': config.ALIVE_IMG
      },
      'caption': _0x239d66
    }, {
      'quoted': _0x2332c3
    });
  } catch (_0x27bbd2) {
    console.log(_0x27bbd2);
    _0x23283b('' + _0x27bbd2);
  }
});

