/*╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺
    ⭐ＰＲＯＪＥＣＴ ＮＡＭＥ:
    ＳＵＢＺＥＲＯ ＷＨＡＴＳＡＰＰ ＭＤ ＢＯＴ
    
    ⭐ＤＥＶＥＬＯＰＥＲ
     ＭＲ ＦＲＡＮＫ 
     
    ⭐ ＭＹ ＴＥＡＭ
     ＸＥＲＯ ＣＯＤＥＲＳ
     
    ⭐ ＯＵＲ ＷＥＢＳＩＴＥ
     https://github.com/ZwSyntax/SUBZERO-MD

© I smell A Noobie Copy Cat🤣⚠
*/

function hi() {
  console.log("Hello World!");
}
hi();
function hi() {
  console.log("Hello World!");
}
hi();
function hi() {
  console.log("Hello World!");
}
hi();
const config = require('../config');
const {
  cmd,
  commands
} = require("../command");
const {
  runtime
} = require("../lib/functions");
cmd({
  'pattern': 'menu',
  'react': '✅',
  'alias': ["panel", 'subzeromenu'],
  'desc': "Get bot's command list.",
  'category': "main",
  'use': ".menu",
  'filename': __filename
}, async (_0xb8d7bb, _0x5536c6, _0x49ccf7, {
  from: _0x33bca2,
  l: _0x2978fb,
  quoted: _0x5b560d,
  body: _0x14c56a,
  isCmd: _0x39e2c8,
  umarmd: _0x397cc3,
  args: _0x398883,
  q: _0x2b7aa6,
  isGroup: _0x10ccfc,
  sender: _0x42ecc3,
  senderNumber: _0x300a13,
  botNumber2: _0x5c0b26,
  botNumber: _0x4c8567,
  pushname: _0x3215c3,
  isMe: _0x181ce7,
  isOwner: _0x9baf07,
  groupMetadata: _0x24205c,
  groupName: _0x496895,
  participants: _0x67b4e2,
  groupAdmins: _0x3ddedc,
  isBotAdmins: _0x42ad5f,
  isAdmins: _0x4448c8,
  reply: _0x5d77ef
}) => {
  try {
    let _0x11578a = "\n\n╭╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺◈\n┊┌⟝⟢ " + config.BOT_NAME + " ⟣⟞\n┊│╭─────────────···◈\n┊┴│\n┊➮│▧ *ᴄʀᴇᴀᴛᴏʀ* : *ᴍʀ ғʀᴀɴᴋ (🇿🇼)*\n┊➮│▧ *ᴍᴏᴅᴇ* : *[" + config.MODE + "]*\n┊➮│▧ *ᴘʀᴇғɪx* : *[" + config.PREFIX + "]*\n┊➮│▧ *ʀᴀᴍ* : " + (process.memoryUsage().heapUsed / 0x400 / 0x400).toFixed(0x2) + "MB / " + Math.round(require('os').totalmem / 0x400 / 0x400) + "MB\n┊➮│▧ *ɴᴀᴍᴇ ʙᴏᴛ* : *sᴜʙᴢᴇʀᴏ ᴍᴅ*\n┊➮│▧ *ᴠᴇʀsɪᴏɴ* : *1.0.2*\n┊➮│▧ *ᴜᴘᴛɪᴍᴇ* : " + runtime(process.uptime()) + "\n┊➮│▸\n┬   │\n│   ╰────────────···◈\n└──────────────────···◈\n\n> ＳＵＢＺＥＲＯ - ＭＤ- ＢＯＴ\n\n\n*📥 `SUBZERO DOWNLOADER` 📥* \n\n╭─────────────···◈\n*┋* *⟡ ғʙ*\n*┋* *⟡ ɪɴꜱᴛᴀ*\n*┋* *⟡ sᴘᴏᴛɪғʏ*\n*┋* *⟡ ᴠɪᴅᴇᴏ*\n*┋* *⟡ ɢᴅʀɪᴠᴇ*\n*┋* *⟡ ᴛᴡɪᴛᴛᴇʀ*\n*┋* *⟡ ᴛᴛ*\n*┋* *⟡ ᴍᴇᴅɪᴀғɪʀᴇ*\n*┋* *⟡ ꜱᴏɴɢ*\n*┋* *⟡ ᴘʟᴀʏ*\n*┋* *⟡ ᴠɪᴅᴇᴏ*\n*┋* *⟡ ᴠɪᴅᴇᴏ2*\n*┋* *⟡ ɪᴍɢ*\n*┋* *⟡ ᴀᴘᴋ*\n*┋* *⟡ ʏᴛᴍᴘ3*\n*┋* *⟡ ʏᴛᴍᴘ4*\n*┋* *⟡ ᴘʟᴀʏ2*\n*┋* *⟡ ʙᴀɪsᴄᴏᴘᴇ*\n*┋* *⟡ ɢɪɴɪsɪsɪʟᴀ*\n*╰─────────────╶╶···◈*\n\n*🔎 `SEARCH-CMD` 🔍* \n\n╭─────────────···◈\n*┋* *⟡ ʏᴛꜱ*\n*┋* *⟡ ʏᴛᴀ*\n*┋* *⟡ ʟᴏʟɪ*\n*┋* *⟡ ᴍᴏᴠɪᴇɪɴғᴏ*\n*┋* *⟡ ɢᴏᴏɢʟᴇ*\n*┋* *⟡ ʙɪʙʟᴇ*\n*┋* *⟡ ᴍᴏᴠɪᴇ*\n*┋* *⟡ ᴡᴇᴀᴛʜᴇʀ*\n*╰─────────────╶╶···◈*\n\n*🧠 `AI-CMD` 🧠* \n\n╭─────────────···◈\n*┋* *⟡ ɢᴘᴛ*\n*┋* *⟡ ᴀɪ*\n*┋* *⟡ sᴜʙᴢᴇʀᴏ*\n*┋* *⟡ ɢᴇᴍɪɴɪ*\n*┋* *⟡ ʙɪɴɢ*\n*┋* *⟡ ᴄᴏᴘɪʟᴏᴛ*\n*┋* *⟡ sᴜʙᴢᴇʀᴏ*\n*╰─────────────╶╶···◈*\n\n*👨‍💻 `OWNER-CMD` 👨‍💻* \n\n╭─────────────···◈\n*┋* *⟡ ᴜᴘᴅᴀᴛᴇᴄᴍᴅ*\n*┋* *⟡ sᴇᴛᴛɪɴɢs*\n*┋* *⟡ ᴏᴡɴᴇʀ*\n*┋* *⟡ ʀᴇᴘᴏ*\n*┋* *⟡ ʙᴏᴛsᴇᴛᴛɪɴɢs*\n*┋* *⟡ ꜱʏꜱᴛᴇᴍ*\n*┋* *⟡ ꜱᴛᴀᴛᴜꜱ*\n*┋* *⟡ ʙʟᴏᴄᴋ*\n*┋* *⟡ ᴜɴʙʟᴏᴄᴋ*\n*┋* *⟡ sʜᴜᴛᴅᴏᴡɴ*\n*┋* *⟡ ᴄʟᴇᴀʀᴄʜᴀᴛs*\n*┋* *⟡ sᴇᴛᴘᴘ*\n*┋* *⟡ ʙʀᴏᴀᴅᴄᴀsᴛ*\n*┋* *⟡ ᴊɪᴅ*\n*┋* *⟡ ɢᴊɪᴅ*\n*┋* *⟡ ʀᴇꜱᴛᴀʀᴛ*\n*╰─────────────╶╶···◈*\n\n*👥 `GROUP-CMD` 👥* \n\n╭─────────────···◈\n*┋* *⟡ ʀᴇᴍᴏᴠᴇ*\n*┋* *⟡ ᴅᴇʟᴇᴛᴇ*\n*┋* *⟡ ᴀᴅᴅ*\n*┋* *⟡ ᴋɪᴄᴋ*\n*┋* *⟡ ᴋɪᴄᴋᴀʟʟ*\n*┋* *⟡ sᴇᴛɢᴏᴏᴅʙʏᴇ*\n*┋* *⟡ sᴇᴛᴡᴇʟᴄᴏᴍᴇ*\n*┋* *⟡ ᴘʀᴏᴍᴏᴛᴇ*\n*┋* *⟡ ᴅᴇᴍᴏᴛᴇ*\n*┋* *⟡ ᴛᴀɢᴀʟʟ*\n*┋* *⟡ ɢᴇᴛᴘɪᴄ*\n*┋* *⟡ ɪɴᴠɪᴛᴇ*\n*┋* *⟡ ʀᴇᴠᴏᴋᴇ*\n*┋* *⟡ ᴊᴏɪɴʀᴇǫᴜᴇsᴛs*\n*┋* *⟡ ᴀʟʟʀᴇǫ*\n*┋* *⟡ ᴍᴜᴛᴇ*\n*┋* *⟡ ᴜɴᴍᴜᴛᴇ*\n*┋* *⟡ ʟᴏᴄᴋɢᴄ*\n*┋* *⟡ ᴜɴʟᴏᴄᴋɢᴄ*\n*┋* *⟡ ʟᴇᴀᴠᴇ*\n*┋* *⟡ ᴜᴘᴅᴀᴛᴇɢɴᴀᴍᴇ*\n*┋* *⟡ ᴜᴘᴅᴀᴛᴇɢᴅᴇsᴄ*\n*┋* *⟡ ᴊᴏɪɴ*\n*┋* *⟡ ʜɪᴅᴇᴛᴀɢ*\n*┋* *⟡ ɢɪɴғᴏ*\n*┋* *⟡ ᴅɪsᴀᴘᴘᴇᴀʀ ᴏɴ*\n*┋* *⟡ ᴅɪsᴀᴘᴘᴇᴀʀ ᴏғғ*\n*┋* *⟡ ᴅɪsᴀᴘᴘᴇᴀʀ 7ᴅ 24ʜ 90ᴅ*\n*┋* *⟡ sᴇɴᴅᴅᴍ*\n*╰─────────────╶╶···◈*\n\n*📃 `INFO-CMD` 📃* \n\n╭─────────────···◈\n*┋* *⟡ ᴍᴇɴᴜ*\n*┋* *⟡ ᴍᴇɴᴜ2*\n*┋* *⟡ ᴍᴇɴᴜ3*\n*┋* *⟡ ᴀʙᴏᴜᴛ*\n*┋* *⟡ sᴄʀɪᴘᴛ*\n*┋* *⟡ ʀᴇᴘᴏ*\n*┋* *⟡ ᴍʀғʀᴀɴᴋ*\n*┋* *⟡ ᴀʟɪᴠᴇ*\n*┋* *⟡ ʙᴏᴛɪɴꜰᴏ*\n*┋* *⟡ ꜱᴛᴀᴛᴜꜱ*\n*┋* *⟡ ꜱᴜᴘᴘᴏʀᴛ*\n*┋* *⟡ ᴘɪɴɢ*\n*┋* *⟡ ᴘɪɴɢ2*\n*┋* *⟡ sᴜʙᴢᴇʀᴏɪɴᴄ*\n*┋* *⟡ ꜱʏꜱᴛᴇᴍ*\n*┋* *⟡ ᴘᴀɪʀ*\n*╰─────────────╶╶···◈*\n\n*🎡 `CONVERTER-CMD` 🎡* \n\n╭─────────────···◈\n*┋* *⟡ sᴛɪᴄᴋᴇʀ*\n*┋* *⟡ ᴛʀᴛ*\n*┋* *⟡ ᴛᴛs*\n*┋* *⟡ ᴛɢsᴛɪᴄᴋᴇʀ*\n*╰─────────────╶╶···◈*\n\n*⛱️ `RANDOM-CMD` ⛱️* \n\n╭─────────────···◈\n*┋* *⟡ sᴜʙᴢᴇʀᴏᴇɴᴠ*\n*┋* *⟡ ᴅᴏɢ*\n*┋* *⟡ ᴀɴɪᴍᴇ*\n*┋* *⟡ ᴀɴɪᴍᴇɢɪʀʟ*\n*┋* *⟡ ᴀɴɪᴍᴇɢɪʀʟ1*\n*┋* *⟡ ᴀɴɪᴍᴇɢɪʀʟ2*\n*┋* *⟡ ᴀɴɪᴍᴇɢɪʀʟ3*\n*┋* *⟡ ᴀɴɪᴍᴇɢɪʀʟ4*\n*┋* *⟡ ᴀɴɪᴍᴇɢɪʀʟ5*\n*╰─────────────╶╶···◈*\n\n*🏜️ `WALLPAPERS-CMD` 🏜️* \n\n╭─────────────···◈\n*┋* *⟡ ɪᴍɢ*\n*╰─────────────╶╶···◈*\n\n*🌐 `OTHER-CMD` 🌐* \n\n╭─────────────···◈\n*┋* *⟡ ᴛʀᴛ*\n*┋* *⟡ ᴊᴏᴋᴇ*\n*┋* *⟡ ꜰᴀᴄᴛ*\n*┋* *⟡ ɢɪᴛʜᴜʙ*\n*┋* *⟡ ɢᴘᴀꜱꜱ*\n*┋* *⟡ ʜᴀᴄᴋ*\n*┋* *⟡ ǫᴜᴏᴛᴇ*\n*┋* *⟡ ʀᴇᴘᴏ*\n*┋* *⟡ ᴛɢsᴛɪᴄᴋᴇʀ*\n*┋* *⟡ ᴅᴇꜰɪɴᴇ*\n*╰─────────────╶╶···◈*\n\n\n━━━━━━━━━━━━━━━━━━━━*⁠⁠⁠⁠\n> ＭＡＤＥ ＢＹ ＭＲ ＦＲＡＮＫ\n━━━━━━━━━━━━━━━━━━━━━\n";
    
    await conn.sendMessage(
            from,
            {
                image: { url: `https://i.postimg.cc/yNf7rQFw/prn.jpg` },
                caption: dec,
                contextInfo: {
                    mentionedJid: [m.sender],
                    forwardingScore: 999,
                    isForwarded: true,
                    forwardedNewsletterMessageInfo: {
                        newsletterJid: '120363304325601080@newsletter',
                        newsletterName: '❄️ 𝐒𝐔𝐁𝐙𝐄𝐑𝐎 𝐌𝐃 ❄️',
                        serverMessageId: 143
                    }
                }
            },
            { quoted: mek }
        );

        // Send audio
        await conn.sendMessage(from, {
            audio: { url: 'https://github.com/JawadYTX/KHAN-DATA/raw/refs/heads/main/autovoice/sigma.m4a' },
            mimetype: 'audio/mp4',
            ptt: true
        }, { quoted: mek });
    
    
  } catch (_0x44375e) {
    console.log(_0x44375e);
    _0x5d77ef('' + _0x44375e);
  }
});
